enderekici/esp32c6-xauusd-chart/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash size (Waveshare ESP32-C6-LCD-1.47 has 8MB embedded flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Custom partition table: nvs + ota metadata + factory + two OTA app slots.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# LCD: keep the SPI master driver in IRAM for smooth flushes.
CONFIG_SPI_MASTER_IN_IRAM=y

# Power management: lets Wi-Fi modem-sleep reduce radio current between beacons.
CONFIG_PM_ENABLE=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y

# TLS cert bundle for HTTPS to data-api.binance.vision (default-on, explicit).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# LVGL fonts (Montserrat) for the chart UI.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
